---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsDoubles
source: html/fd935c77-7633-9fda-3052-41540fbf5346.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsDoubles Method

Gets the value property as doubles.

## Syntax (C#)
```csharp
public IList<double> GetValueAsDoubles()
```

## Returns
The value as doubles.